# Equivalencias entre SQL y Pandas

Veremos como hacer diferentes consultas SQL en Pandas

In [3]:
import pandas as pd

#Carguemos el dataframe que utilizaremos
data = "dataset/tips.csv"
df_tips = pd.read_csv(data)
df_tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

## SELECT

In [4]:
#
#  SELECT
#      total_bill,
#      tip,
#      smoker,
#      time
#  FROM
#      tips_df
#  LIMIT 5;
#
df_tips[
    [
        "total_bill",
        "tip",
        "smoker",
        "time",
    ]
].head(5)

   total_bill   tip smoker    time
0       16.99  1.01     No  Dinner
1       10.34  1.66     No  Dinner
2       21.01  3.50     No  Dinner
3       23.68  3.31     No  Dinner
4       24.59  3.61     No  Dinner

## SELECT DISTINCT

In [6]:
#
#  SELECT DISTINCT
#      day
#  FROM
#      tips_df
#  LIMIT 5;
#
df_tips["day"].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

## ORDER BY

In [5]:
#
#  SELECT
#      *
#  FROM
#      tips
#  ORDER BY
#      total_bill ASC
#  LIMIT 5;
#
df_tips.sort_values('total_bill').head(5)

     total_bill   tip     sex smoker   day    time  size
67         3.07  1.00  Female    Yes   Sat  Dinner     1
92         5.75  1.00  Female    Yes   Fri  Dinner     2
111        7.25  1.00  Female     No   Sat  Dinner     1
172        7.25  5.15    Male    Yes   Sun  Dinner     2
149        7.51  2.00    Male     No  Thur   Lunch     2

Ordenado de manera ascendente

In [9]:
df_tips.sort_values(
    "total_bill",
    ascending=True
).head()

     total_bill   tip     sex smoker   day    time  size
67         3.07  1.00  Female    Yes   Sat  Dinner     1
92         5.75  1.00  Female    Yes   Fri  Dinner     2
111        7.25  1.00  Female     No   Sat  Dinner     1
172        7.25  5.15    Male    Yes   Sun  Dinner     2
149        7.51  2.00    Male     No  Thur   Lunch     2

Ordenado de manera descendente

In [11]:
df_tips.sort_values(
    "total_bill",
    ascending=False
).head()

     total_bill    tip   sex smoker  day    time  size
170       50.81  10.00  Male    Yes  Sat  Dinner     3
212       48.33   9.00  Male     No  Sat  Dinner     4
59        48.27   6.73  Male     No  Sat  Dinner     4
156       48.17   5.00  Male     No  Sun  Dinner     6
182       45.35   3.50  Male    Yes  Sun  Dinner     3

## WHERE

In [12]:
#
#  SELECT
#      *
#  FROM
#      df
#  WHERE
#      time = 'Dinner'
#  LIMIT 5;
#
df_tips[df_tips['time'] == 'Dinner'].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Contemos cuantas veces se repite Dinner en time

In [13]:
is_dinner = df_tips["time"] == "Dinner"
is_dinner.value_counts()

time
True     176
False     68
Name: count, dtype: int64

Obtengamos los registros que son la cena (Dinner)

In [15]:
df_tips[is_dinner].head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

También podemos usar el método query para poner la condición

In [16]:
df_tips.query("time == 'Dinner'").head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Hagamos una consulta compuesta

In [17]:
#
#  SELECT
#      *
#  FROM
#      df
#  WHERE
#      time = 'Dinner' AND tip > 5.00;
#
df_tips[(df_tips['time'] == 'Dinner') & (df_tips['tip'] > 5.00)]

     total_bill    tip     sex smoker  day    time  size
23        39.42   7.58    Male     No  Sat  Dinner     4
44        30.40   5.60    Male     No  Sun  Dinner     4
47        32.40   6.00    Male     No  Sun  Dinner     4
52        34.81   5.20  Female     No  Sun  Dinner     4
59        48.27   6.73    Male     No  Sat  Dinner     4
116       29.93   5.07    Male     No  Sun  Dinner     4
155       29.85   5.14  Female     No  Sun  Dinner     5
170       50.81  10.00    Male    Yes  Sat  Dinner     3
172        7.25   5.15    Male    Yes  Sun  Dinner     2
181       23.33   5.65    Male    Yes  Sun  Dinner     2
183       23.17   6.50    Male    Yes  Sun  Dinner     4
211       25.89   5.16    Male    Yes  Sat  Dinner     4
212       48.33   9.00    Male     No  Sat  Dinner     4
214       28.17   6.50  Female    Yes  Sat  Dinner     3
239       29.03   5.92    Male     No  Sat  Dinner     3

In [18]:
#
#  SELECT
#      *
#  FROM
#      df
#  WHERE
#      size >= 5 OR total_bill > 45;
#
df_tips[(df_tips['size'] >= 5) | (df_tips['total_bill'] > 45)]

     total_bill    tip     sex smoker   day    time  size
59        48.27   6.73    Male     No   Sat  Dinner     4
125       29.80   4.20  Female     No  Thur   Lunch     6
141       34.30   6.70    Male     No  Thur   Lunch     6
142       41.19   5.00    Male     No  Thur   Lunch     5
143       27.05   5.00  Female     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
156       48.17   5.00    Male     No   Sun  Dinner     6
170       50.81  10.00    Male    Yes   Sat  Dinner     3
182       45.35   3.50    Male    Yes   Sun  Dinner     3
185       20.69   5.00    Male     No   Sun  Dinner     5
187       30.46   2.00    Male    Yes   Sun  Dinner     5
212       48.33   9.00    Male     No   Sat  Dinner     4
216       28.15   3.00    Male    Yes   Sat  Dinner     5

## GROUP BY

In [19]:
#
#  SELECT
#      sex,
#      count(*)
#  FROM
#      df
#  GROUP BY
#      sex;
#
df_tips.groupby('sex').size()

sex
Female     87
Male      157
dtype: int64

In [22]:
df_tips.groupby("sex").count()

        total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           157  157     157  157   157   157

In [23]:
df_tips.groupby("sex")["total_bill"].count()

sex
Female     87
Male      157
Name: total_bill, dtype: int64

In [25]:
#
#  SELECT
#      day,
#      AVG(tip),
#      COUNT(*)
#  FROM
#      df
#  GROUP BY
#      day;
#
df_tips.groupby('day').agg({'tip': "mean", 'day': "size"})

           tip  day
day
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thur  2.771452   62

In [26]:
#
#  SELECT
#      smoker,
#      day,
#      COUNT(*),
#      AVG(tip)
#  FROM
#      df
#  GROUP BY
#      smoker,
#      day;
#
df_tips.groupby(['smoker', 'day']).agg({'tip': ["size", "mean"]})

             tip
            size      mean
smoker day
No     Fri     4  2.812500
       Sat    45  3.102889
       Sun    57  3.167895
       Thur   45  2.673778
Yes    Fri    15  2.714000
       Sat    42  2.875476
       Sun    19  3.516842
       Thur   17  3.030000


## Funciones que pueden ser aplicadas a un DataFrame:

*    abs        all       any       clip    clip_lower  clip_upper
*    corr       corrwith  count     cov     cummax      cummin
*    cumprod    cumsum    describe  diff    eval        kurt
*    mad        max       mean      median  min         mode
*    ct_change  prod      quantile  rank    round       sem
*    skew       sum       std       var

## INNER JOIN

Creemos los dataframes a los que les haremos los diferentes JOIN

In [27]:
import numpy as np

df1 = pd.DataFrame(
    {
        "key": ["A", "B", "C", "D"],
        "value": np.random.randn(4)
    }
)

df1

  key     value
0   A  0.069069
1   B -0.714999
2   C -0.140439
3   D  0.776514

In [28]:
df2 = pd.DataFrame(
    {
        'key': ['B', 'D', 'D', 'E'],
        'value': np.random.randn(4)
    }
)

df2

  key     value
0   B -0.229862
1   D  0.741881
2   D  0.094908
3   E  0.465030

ahora sí hagamos el inner JOIN

In [29]:
#
#  SELECT
#      *
#  FROM
#      df1
#  INNER JOIN
#      df2
#  ON df1.key = df2.key;
#
pd.merge(
    df1,
    df2,
    on="key",
)

  key   value_x   value_y
0   B -0.714999 -0.229862
1   D  0.776514  0.741881
2   D  0.776514  0.094908

## LEFT OUTER JOIN

In [30]:
#
#  SELECT
#      *
#  FROM
#      df1
#  LEFT OUTER JOIN
#      df2
#  ON
#      df1.key = df2.key;
#
pd.merge(
    df1,
    df2,
    on="key",
    how="left",
)

  key   value_x   value_y
0   A  0.069069       NaN
1   B -0.714999 -0.229862
2   C -0.140439       NaN
3   D  0.776514  0.741881
4   D  0.776514  0.094908

## RIGHT OUTER JOIN

In [31]:
#
#  SELECT
#      *
#  FROM
#      df1
#  RIGHT OUTER JOIN
#      df2
# ON
#     df1.key = df2.key;
#
pd.merge(
    df1,
    df2,
    on="key",
    how="right",
)

  key   value_x   value_y
0   B -0.714999 -0.229862
1   D  0.776514  0.741881
2   D  0.776514  0.094908
3   E       NaN  0.465030

## FULL OUTER JOIN

In [32]:
#
#  SELECT
#      *
#  FROM
#      df1
#  FULL OUTER JOIN
#      df2
#  ON
#      df1.key = df2.key;
#
pd.merge(df1, df2, on='key', how='outer')

  key   value_x   value_y
0   A  0.069069       NaN
1   B -0.714999 -0.229862
2   C -0.140439       NaN
3   D  0.776514  0.741881
4   D  0.776514  0.094908
5   E       NaN  0.465030

## UNION

Creemos los dataframes para mostrar esta característica

In [33]:
df1 = pd.DataFrame(
    {
        'city': ['Chicago', 'San Francisco', 'New York City'],
        'rank': range(1, 4)
    }
)

df1

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3

In [34]:
df2 = pd.DataFrame(
    {
        'city': ['Chicago', 'Boston', 'Los Angeles'],
        'rank': [1, 4, 5]
    }
)

df2

          city  rank
0      Chicago     1
1       Boston     4
2  Los Angeles     5

### UNION ALL (si hay datos iguales en ambas tablas, aparecen duplicados)

In [35]:
#
#  SELECT city, rank
#  FROM df1
#  UNION ALL
#  SELECT city, rank
#  FROM df2;
#
pd.concat(
    [df1, df2],
)

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

### UNION (sin duplicados)

In [36]:
#
#  SELECT
#      city,
#     rank
#  FROM
#      df1
#  UNION
#      SELECT
#          city,
#          rank
#      FROM
#          df2
#
pd.concat(
    [df1, df2],
).drop_duplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5

## Primeras N filas con desplazamientos (offset)

In [38]:
#
#  SELECT
#      *
#  FROM
#      tips
#  ORDER BY
#      tip DESC
#  LIMIT 10 OFFSET 5;
#
df_tips.nlargest(10 + 5, columns='tip').tail(10)

     total_bill   tip     sex smoker   day    time  size
183       23.17  6.50    Male    Yes   Sun  Dinner     4
214       28.17  6.50  Female    Yes   Sat  Dinner     3
47        32.40  6.00    Male     No   Sun  Dinner     4
239       29.03  5.92    Male     No   Sat  Dinner     3
88        24.71  5.85    Male     No  Thur   Lunch     2
181       23.33  5.65    Male    Yes   Sun  Dinner     2
44        30.40  5.60    Male     No   Sun  Dinner     4
52        34.81  5.20  Female     No   Sun  Dinner     4
85        34.83  5.17  Female     No  Thur   Lunch     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4

## Primeras N filas por grupo

In [40]:
#
#  SELECT * FROM (
#    SELECT
#      t.*,
#      ROW_NUMBER() OVER(PARTITION BY day ORDER BY total_bill DESC) AS rn
#    FROM df t
#  )
#  WHERE rn < 3
#  ORDER BY day, rn;
#
(
    df_tips.assign(
        rn=df_tips.sort_values(
            ["total_bill"],
            ascending=False,
        )
        .groupby(["day"])
        .cumcount()
        + 1
    )
    .query("rn < 3")
    .sort_values(["day", "rn"])
)

     total_bill    tip     sex smoker   day    time  size  rn
95        40.17   4.73    Male    Yes   Fri  Dinner     4   1
90        28.97   3.00    Male    Yes   Fri  Dinner     2   2
170       50.81  10.00    Male    Yes   Sat  Dinner     3   1
212       48.33   9.00    Male     No   Sat  Dinner     4   2
156       48.17   5.00    Male     No   Sun  Dinner     6   1
182       45.35   3.50    Male    Yes   Sun  Dinner     3   2
197       43.11   5.00  Female    Yes  Thur   Lunch     4   1
142       41.19   5.00    Male     No  Thur   Lunch     5   2

In [41]:
(
    df_tips.assign(
        rnk=df_tips.groupby(["day"])["total_bill"].rank(
            method="first",
            ascending=False,
        )
    )
    .query("rnk < 3")
    .sort_values(["day", "rnk"])
)

     total_bill    tip     sex smoker   day    time  size  rnk
95        40.17   4.73    Male    Yes   Fri  Dinner     4  1.0
90        28.97   3.00    Male    Yes   Fri  Dinner     2  2.0
170       50.81  10.00    Male    Yes   Sat  Dinner     3  1.0
212       48.33   9.00    Male     No   Sat  Dinner     4  2.0
156       48.17   5.00    Male     No   Sun  Dinner     6  1.0
182       45.35   3.50    Male    Yes   Sun  Dinner     3  2.0
197       43.11   5.00  Female    Yes  Thur   Lunch     4  1.0
142       41.19   5.00    Male     No  Thur   Lunch     5  2.0

In [42]:
#
#  SELECT * FROM (
#      SELECT
#          t.*,
#          RANK() OVER(PARTITION BY sex ORDER BY tip) AS rnk
#      FROM tips t
#      WHERE tip < 2
#  )
#  WHERE rnk < 3
#  ORDER BY sex, rnk;
#
(
    df_tips[df_tips["tip"] < 2]
    .assign(rnk_min=df_tips.groupby(["sex"])["tip"].rank(method="min"))
    .query("rnk_min < 3")
    .sort_values(["sex", "rnk_min"])
)

     total_bill   tip     sex smoker  day    time  size  rnk_min
67         3.07  1.00  Female    Yes  Sat  Dinner     1      1.0
92         5.75  1.00  Female    Yes  Fri  Dinner     2      1.0
111        7.25  1.00  Female     No  Sat  Dinner     1      1.0
236       12.60  1.00    Male    Yes  Sat  Dinner     2      1.0
237       32.83  1.17    Male    Yes  Sat  Dinner     2      2.0

## UPDATE

In [43]:
#
#  UPDATE
#      tips
#  SET
#      tip = tip*2
#  WHERE
#      tip < 2;
#
df_tips.loc[df_tips['tip'] < 2, 'tip'] *= 2
df_tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  2.02  Female     No  Sun  Dinner     2
1       10.34  3.32    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## DELETE

In [44]:
#
#  DELETE FROM
#      tips
#  WHERE
#      tip > 9;
#
df_tips.loc[df_tips['tip'] <= 9].head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  2.02  Female     No  Sun  Dinner     2
1       10.34  3.32    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  3.92    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2